{"/about/":{"data":{"":"","disclaimer#Disclaimer":"The information and opinions posted on this website do not reflect the opinions of my employer. Providing this information publicly without regard for you or your organization’s specific scenario does not count as consulting and thus does not bar me nor my employer from assessing your organization for compliance with CMMC.","how-are-you-determining-this#How are you determining this?":"To learn more about the methods used, please see this page: Methods","is-this-website-associated-with-nist-or-any-government-agency#Is this website associated with NIST or any government agency?":"No, this website does not reflect the views or opinions of any government agency, nor is there any relation between this website and the U.S. Government.","who-are-you#Who are you?":"Hi! I’m Lia. I work as a cybersecurity assessor and M365 systems administrator. I hold Security+ CE and CCP certifications.","why#Why?":"Why? This page is born out of the frustration of trying to find FIPS-validated printers for CMMC compliance. And also so my GF gives me an apple juice."},"title":"About"},"/about/methods/":{"data":{"":"","finding-printers#Finding Printers":"The FIPS-Validated printer search usually starts (well, let’s be honest, it starts with a Google search for “FIPS-Validated Printers”) with NIAP, the National Information Assurance Partnership which was established by NIST and NSA. NIAP has lists of Commercial Off-The-Shelf (COTS) products that have undergone testing and have been validated to pass a certain level of security requirements. NIAP calls these security requirements “Protection Profiles”\nProtection Profiles The NIAP protection profile for printers and MFPs is Protection Profile for Hardcopy Devices Version 1.0 (PP_HCD_V1.0) which will be sunset on 10/23/2024. The successor to PP_HCD_V1.0, is collaborative Protection Profile for Hardcopy Devices Version 1.0E (CPP_HCD_V1.0E) which will take effect on 10/23/2024 (Hard cutover).\nNeither PP_HCD_V1.0 nor CPP_HCD_V1.0E mandates FIPS modules used for cryptography to be validated. The NIAP list of printers/MFPs under the “Hardcopy” protection profiles is not authoritative for all FIPS-Validated printers (especially since the profiles don’t require FIPS valdiation) but this list is still a good list of pre-vetted products which are concious about security. There seems to be a high correlation between printers on the NIAP’s list, and printers which have FIPS-Validated modules installed.","theory#Theory":"Theory For the process of FIPS-Validated printing, there are two primary scenarios.\nScenario A: Network Provides the Transport Encryption The computer and printer both establish an encrypted connection with the network, and the network enables them to communicate with each other in an encrypted manner. A technical implementation of this might be something like 802.1AE/MACSec\nsequenceDiagram autonumber participant L as Laptop/PC participant N as Network participant P as Printer L-\u003e\u003eN: Encrypted N-\u003e\u003eP: Encrypted P-\u003e\u003eP: Queueing (encrypted at rest) P-\u003e\u003eP: PrintingScenario B: Transport Encryption is Provided by the Printer The computer establishes an encrypted channel with the printer directly, over an unencrypted network. Technical implementations of this might include: IPP over HTTPS, IPSec, or a proprietary encrypted printing protocol.\nsequenceDiagram autonumber participant L as Laptop/PC participant N as Network participant P as Printer L-\u003e\u003eP: Encrypted P-\u003e\u003eP: Queueing (encrypted at rest) P-\u003e\u003eP: PrintingThis website focuses on Scenario B, but the printers listed here would be good candidates for Scenario A, as the printer still needs to be able to securely store the print jobs at rest."},"title":"Methods"},"/printers/":{"data":{"":" Manufacturer Make/Device Class Model Marketing Website FIPS Certificate Number Canon imageRUNNER ADVANCE DX C5800 Series, C3900 Series, C359iF Series, C568iF Series, 8900 Series, 6800 Series, 6980i Model, 4900 Series, 719iF Series https://canon.com #3631 "},"title":"Awesome FIPS-Validated Printers"},"/printers/imagerunner-advance-dx/":{"data":{"":"2024\ncenters\nManufacturer Canon Make/Device Class imageRUNNER ADVANCE DX Model C5800 Series, C3900 Series, C359iF Series, C568iF Series, 8900 Series, 6800 Series, 6980i Model, 4900 Series, 719iF Series Marketing Website https://canon.com Secure Configuration Guide https://www.usa.canon.com/bin/canon/downloadasset?path=/content/dam/canon-assets/brochures/business/security/iRADV-Security-Hardening-Guide.pdf FIPS Certificate Number #3631 FIPS Cert Link https://csrc.nist.gov/projects/cryptographic-module-validation-program/certificate/3631 Source https://www.usa.canon.com/bin/canon/downloadasset?path=/content/dam/canon-assets/brochures/business/copiers-and-mfp/imagerunner-advance-dx/Enterprise-Control-Brochure.pdf dafasdf\nManufacturer Make/Device Class Model Marketing Website Secure Configuration Guide FIPS Certificate Number FIPS Cert Link Source Canon imageRUNNER ADVANCE DX C5800 Series, C3900 Series, C359iF Series, C568iF Series, 8900 Series, 6800 Series, 6980i Model, 4900 Series, 719iF Series https://canon.com https://www.usa.canon.com/bin/canon/downloadasset?path=/content/dam/canon-assets/brochures/business/security/iRADV-Security-Hardening-Guide.pdf #3631 https://csrc.nist.gov/projects/cryptographic-module-validation-program/certificate/3631 https://www.usa.canon.com/bin/canon/downloadasset?path=/content/dam/canon-assets/brochures/business/copiers-and-mfp/imagerunner-advance-dx/Enterprise-Control-Brochure.pdf "},"title":"ImageRUNNER ADVANCE DX"},"/resources/acronyms/":{"data":{"":" Term Definition NIST National Institute of Standards and Technology NIAP National Information Assurance Partnership MFP Multi-Funtion Printer IPP Internet Printing Protocol FIPS Federal Information Processing Standards CMVP Cryptographic Module Validation Program CAVP Cryptographic Algorithm Validation Program "},"title":"Acronyms"}}